artillery-events.yml
config:
  target: "http://localhost:3036"
  phases:
    - duration: 60 # run for 60s
      arrivalRate: 10 # start at ~10 new VU/sec
      rampTo: 1000 # ramp linearly to ~x new VUs/sec by the end

  # Cap concurrency so we don't exceed ~x simultaneous users
  # (actual concurrency depends on request duration; this prevents runaway VUs)
  pool:
    maxVusers: 1000

  # Good defaults
  defaults:
    headers:
      Content-Type: application/json
  http:
    timeout: 10 # seconds

  # Optional SLO guardrails (fail the run if breached)
  ensure:
    - "p95(latency) < 800"
    - "http.response_rate > 0.99"

scenarios:
  - name: Public API smoke (no auth)
    flow:
      - get:
          url: "/api/events/health"
          expect:
            - statusCode: 200
      - get:
          url: "/api/events/"
          expect:
            - statusCode: 200